<HTML>
<head><link rel=stylesheet type="text/css" href="style.css"><title>&Uuml;ber Verschl&uuml;sselung</title></head>

<BODY BGCOLOR=#FFFFFF>
<FONT FACE="Arial, Lucida, Helvetica">
<A NAME="UeberVerschluesselung"></A><CENTER>
<A HREF="cryptote_contents.html"><img align=center src="contents.gif" BORDER=0 ALT="Contents"></A> <A HREF="cryptote_einfuehrung.html#Einfuehrung"><img align=center src="back.gif" BORDER=0 ALT="Previous"></A> <A HREF="cryptote_funktionsumfang.html#Funktionsumfang"><img align=center src="forward.gif" BORDER=0 ALT="Next"></A> </CENTER><HR>

<H2>&Uuml;ber Verschl&uuml;sselung</H2>
<P>
<A HREF="#SchlechtePasswoerter">Schlechte Passw&ouml;rter</A><BR>
<A HREF="#VorgehenPasswort">Vorgehen um ein gutes Passwort zu lernen</A><BR>
<A HREF="#MassSicherheit">Ma&szlig; an Sicherheit</A><BR>
<P>

<HR>
<A NAME="SchlechtePasswoerter"></A>
<H3>Schlechte Passw&ouml;rter</H3>
<P>
Zur Verwendung von guten Passw&ouml;rtern werden von vielen Seiten Ratschl&auml;ge erteilt, die aber oft schwer umzusetzen und daher nicht befolgt werden. Im folgenden wird eine einfache Methode gezeigt, mit der Sie Ihre privaten Logindaten sicher sch&uuml;tzen k&ouml;nnen.<P>
Zu Anfang: versuchen Sie nicht an Pass<EM>w&ouml;rter</EM> zu denken, sondern betrachten Sie eher Pass<B>ausdr&uuml;cke</B>. Kein Verschl&uuml;sselungsprogramm kann Ihre Daten sichern, wenn Sie das Zugriffspasswort auf ein einfaches englisches oder deutsches Wort setzen, oder noch schlimmer, ein kurzes Wort, dass mit ihrer Person oder Umgebung im Zusammenhang steht. Im Internet findet man viele Listen schlechter und dennoch h&auml;ufig verwendeter Passw&ouml;rter: suchen einfach nach ,,top 100 passwords".<P>
Mit dem Problem konfrontiert sich ein l&auml;ngeres Passwort merken zu m&uuml;ssen, wollen die meisten Menschen dies nat&uuml;rlicherweise aufschreiben. Und im n&auml;chsten verh&auml;ngnisvollen Schritt wird dieser Papierschnipsel dann direkt am Rechner aufbewahrt. Machen Sie das besser! <P>
Um Ihnen eine Vorstellung von einem guten Passwort zu geben: Betrachten Sie, dass der Serpent Algorithmus 256 Schl&uuml;sselbits verwendet. Das sind 256 Bits zuf&auml;lliger Information. Ein durchschnittlicher englischer oder deutscher Text hat 1.0 bis 1.5 Informationbits pro Buchstabe.<P>
Dieser ganze Satz entspricht also nur ungef&auml;hr 47 Bits!<P>
Die Schl&uuml;sselbits (genauer: Entropierate) kann mittels Namen, Symbolen und Sonderzeichen oder anderen besonderen Sprachelementen erh&ouml;ht werden. Ein zuf&auml;llig ausgew&auml;hlter Gro&szlig;- oder Kleinbuchstabe hat 5.7 Schl&uuml;sselbits.<P>

<HR>
<A NAME="VorgehenPasswort"></A>
<H3>Vorgehen um ein gutes Passwort zu lernen</H3>
<P>
Mein Vorgehen, um ein neues, sicheres Passwort zu lernen, ist einfach: Ich benutze den Zufallsgenerator, der in CryptoTE integriert ist und lasse diesen ein Zufallszeichenkette generierten. Dieser bietet viele anpassbare Optionen. Insbesondere verwende ich nie z/y in einem Passwort, da diese auf den deutschen und englischen Tastaturlayouts vertauscht sind. Kein z/y, keine Probleme.<P>
Je nach Einsatz, verwende ich nur Kleinbuchstaben und w&auml;hle eine ad&auml;quate Passwortl&auml;nge: Der Generator errechnet die theoretischen Schl&uuml;sselbits der angepassten Optionen. Passen Sie die L&auml;nge ihren Anforderungen an.<P>
Mein Containerpasswort ist circa 25 Gro&szlig;- oder Kleinbuchstaben lang. Das sind 139.6 Schl&uuml;sselbits. Viel mehr als ein einfacher Satz. Das Kennwort sieht etwa so aus: DUWHmnBunfVQNUeCdQxpHHdIJ.<P>
Sie denken Sie k&ouml;nnen sich niemals 25 zuf&auml;llige Zeichen merken? <B>Versuchen Sie es!</B> Ihr Ged&auml;chtnis ist weit besser also Sie es glauben. Lernen Sie die Zeichen durch Wiederholung:<P>
Ich verwende CryptoTE jeden Tag, um auf irgendwelche Passw&ouml;rter zu zugreifen, und er verlangt jedes mal das (lange) Passwort. Durch diese h&auml;ufigen Wiederholungen werden <B>auch Sie</B> eine zuf&auml;llige Zeichenfolge schnell lernen. In der Anfangsphase (Eine Woche oder so) k&ouml;nnen Sie das Passwort auch auf einen Papierschnippsel aufschreiben, aber bewahren Sie den Zettel sicher auf! Mein Lieblingsort: der Geldbeutel. Nach zwei Wochen: Verbrennen Sie ihn!<P>
Wenn Sie glauben 25 Buchstaben sind viel zu viele: Versuchen Sie es erstmal mit zehn, also etwa rZl2jXybem. Das sind immerhin schon 57 Schl&uuml;sselbits.<P>

<HR>
<A NAME="MassSicherheit"></A>
<H3>Ma&szlig; an Sicherheit</H3>
<P>
CryptoTE kann Ihren Text sichern, aber Sie m&uuml;ssen &uuml;berlegen, ob der Einsatz von Verschl&uuml;sselung f&uuml;r Ihren Einsatzzweck wirklich angebracht ist. Vor wem wollen Sie ihre Passw&ouml;rter sicher aufbewahren?<P>
<UL>

  <LI> Sie vor Ihren Kindern, Mitbewohnern, Kollegen, Frau oder Mann zu sch&uuml;tzen, die ab und zu den Rechner verwenden: Okay.
  <LI> Um sicher zu gehen, dass keine wichtigen Daten lesbar sind, falls Ihr Notebook oder USB-Stick geklaut wird: auch Okay.
  <LI> Gegen ,,Phishing" oder ,,Keylogger": Keine Chance, diese sehen das eingegebene Passwort.
  <LI> Gegen die Polizei oder andere Gesetzesh&uuml;ter: Nicht gut! Sie landen auf unbestimmte Zeit im Gef&auml;ngnis.
  <LI> Gegen finstere, b&ouml;sartige Gestalten: Keine Chance! Die werden mit dem Brecheisen nicht den Rechner, sondern <B>Sie</B> bearbeiten.
</UL>
<P>

</FONT></BODY></HTML>
